Autodesk.Revit.DB.ExternalResourceServiceUtils.GetServers
Gets registered external resource servers
Since:
2015

Autodesk.Revit.DB.ExternalResourceServiceUtils.GetServersByType(Autodesk.Revit.DB.ExternalResourceType)
Gets registered external resource servers which support the external resource type.
type:
The external resource type for the servers to match
Returns:
A list of matched external resource servers
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.ExternalResourceServiceUtils
Contains utilities related to external resource service.
Since:
2015